export const ports_4_5 = {
  deck_ports: {
    "1": {
      id: 1,
      name: "第1艦隊",
      mission: [0, 0, 0, 0],
      ship: [3244, 142, 481, 361, 56, 1927],
    },
    "2": {
      id: 2,
      name: "北方鼠輸送作戦遠征艦隊",
      mission: [0, 0, 0, 0],
      ship: [2872, 1, 894, 589, 454, 569],
    },
    "3": {
      id: 3,
      name: "水上機前線輸送遠征艦隊",
      mission: [0, 0, 0, 0],
      ship: [175, 7701, 4448, 4827, 1227, 5773],
    },
    "4": {
      id: 4,
      name: "鼠輸送作戦遠征艦隊",
      mission: [0, 0, 0, 0],
      ship: [927, 13053, 4762, 7535, 3006, 2472],
    },
  },
  combined_flag: null,
};
