export const ports_5_5 = {
  deck_ports: {
    "1": {
      id: 1,
      name: "第1艦隊",
      mission: [0, 0, 0, 0],
      ship: [10322, 11166, 3061, 4299, 56, 361],
    },
    "2": {
      id: 2,
      name: "北方鼠輸送作戦遠征艦隊",
      mission: [1, 34, 1758471496177, 0],
      ship: [138, 142, 3244, 34, 1271, 90],
    },
    "3": {
      id: 3,
      name: "水上機前線輸送遠征艦隊",
      mission: [1, 40, 1758493933045, 0],
      ship: [175, 7701, 4448, 4827, 1227, 5773],
    },
    "4": {
      id: 4,
      name: "鼠輸送作戦遠征艦隊",
      mission: [1, 33, 1758470589124, 0],
      ship: [576, 1162, 732, 103, 1848, 9434],
    },
  },
  combined_flag: null,
};
