import type { MstSlotItemEquipTypes } from "@ipc-bindings/get_data";

export const mst_slot_item_equip_types: MstSlotItemEquipTypes = {
  mst_slotitem_equip_types: {
    "1": {
      id: 1,
      name: "小口径主砲",
    },
    "2": {
      id: 2,
      name: "中口径主砲",
    },
    "3": {
      id: 3,
      name: "大口径主砲",
    },
    "4": {
      id: 4,
      name: "副砲",
    },
    "5": {
      id: 5,
      name: "魚雷",
    },
    "6": {
      id: 6,
      name: "艦上戦闘機",
    },
    "7": {
      id: 7,
      name: "艦上爆撃機",
    },
    "8": {
      id: 8,
      name: "艦上攻撃機",
    },
    "9": {
      id: 9,
      name: "艦上偵察機",
    },
    "10": {
      id: 10,
      name: "水上偵察機",
    },
    "11": {
      id: 11,
      name: "水上爆撃機",
    },
    "12": {
      id: 12,
      name: "小型電探",
    },
    "13": {
      id: 13,
      name: "大型電探",
    },
    "14": {
      id: 14,
      name: "ソナー",
    },
    "15": {
      id: 15,
      name: "爆雷",
    },
    "16": {
      id: 16,
      name: "追加装甲",
    },
    "17": {
      id: 17,
      name: "機関部強化",
    },
    "18": {
      id: 18,
      name: "対空強化弾",
    },
    "19": {
      id: 19,
      name: "対艦強化弾",
    },
    "20": {
      id: 20,
      name: "VT信管",
    },
    "21": {
      id: 21,
      name: "対空機銃",
    },
    "22": {
      id: 22,
      name: "特殊潜航艇",
    },
    "23": {
      id: 23,
      name: "応急修理要員",
    },
    "24": {
      id: 24,
      name: "上陸用舟艇",
    },
    "25": {
      id: 25,
      name: "オートジャイロ",
    },
    "26": {
      id: 26,
      name: "対潜哨戒機",
    },
    "27": {
      id: 27,
      name: "追加装甲(中型)",
    },
    "28": {
      id: 28,
      name: "追加装甲(大型)",
    },
    "29": {
      id: 29,
      name: "探照灯",
    },
    "30": {
      id: 30,
      name: "簡易輸送部材",
    },
    "31": {
      id: 31,
      name: "艦艇修理施設",
    },
    "32": {
      id: 32,
      name: "潜水艦魚雷",
    },
    "33": {
      id: 33,
      name: "照明弾",
    },
    "34": {
      id: 34,
      name: "司令部施設",
    },
    "35": {
      id: 35,
      name: "航空要員",
    },
    "36": {
      id: 36,
      name: "高射装置",
    },
    "37": {
      id: 37,
      name: "対地装備",
    },
    "38": {
      id: 38,
      name: "大口径主砲（II）",
    },
    "39": {
      id: 39,
      name: "水上艦要員",
    },
    "40": {
      id: 40,
      name: "大型ソナー",
    },
    "41": {
      id: 41,
      name: "大型飛行艇",
    },
    "42": {
      id: 42,
      name: "大型探照灯",
    },
    "43": {
      id: 43,
      name: "戦闘糧食",
    },
    "44": {
      id: 44,
      name: "補給物資",
    },
    "45": {
      id: 45,
      name: "水上戦闘機",
    },
    "46": {
      id: 46,
      name: "特型内火艇",
    },
    "47": {
      id: 47,
      name: "陸上攻撃機",
    },
    "48": {
      id: 48,
      name: "局地戦闘機",
    },
    "49": {
      id: 49,
      name: "陸上偵察機",
    },
    "50": {
      id: 50,
      name: "輸送機材",
    },
    "51": {
      id: 51,
      name: "潜水艦装備",
    },
    "52": {
      id: 52,
      name: "陸戦部隊",
    },
    "53": {
      id: 53,
      name: "大型陸上機",
    },
    "54": {
      id: 54,
      name: "水上艦装備",
    },
    "56": {
      id: 56,
      name: "噴式戦闘機",
    },
    "57": {
      id: 57,
      name: "噴式戦闘爆撃機",
    },
    "58": {
      id: 58,
      name: "噴式攻撃機",
    },
    "59": {
      id: 59,
      name: "噴式偵察機",
    },
    "91": {
      id: 91,
      name: "噴式戦闘爆撃機(II",
    },
    "93": {
      id: 93,
      name: "大型電探（II）",
    },
    "94": {
      id: 94,
      name: "艦上偵察機（II）",
    },
    "95": {
      id: 95,
      name: "副砲（II）",
    },
  },
};
